In [ ]:
import pandas as pd
import logging as lg
import os
import csv
import mysql.connector as connection

In [38]:
data = pd.read_csv("Test.csv")

In [39]:
data.head()

     Name   Age   Surname       Phone
0    Harsh   25     Kumar  8102297062
1     Sonu   26       Raj  9103398061
2  Vishal    25  Kushwaha  6252789541
3    Anand   23     Mehta  7895416253
4   Vipul    27     Dubey  4565521463

In [103]:
type(data)

pandas.core.frame.DataFrame

In [104]:
df = pd.DataFrame(data)

print(df)

     Name   Age    Surname       Phone
0    Harsh   25      Kumar  8102297062
1     Sonu   26        Raj  9103398061
2  Vishal    25   Kushwaha  6252789541
3    Anand   23      Mehta  7895416253
4   Vipul    27      Dubey  4565521463
5    Vijay   22  Prajapati  8574964152
6    Asif    25        Ali  1234567885
7   Rahul    21      Kumar  9638527418
8   Tomak    20      Gorai  9685742314

# Loading Iris Data

In [13]:
import pandas as pd
irisData = pd.read_csv('https://github.com/Muhd-Shahid/Write-Raw-File-into-Database-Server/raw/main/iris.csv',index_col=False)
irisData.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [3]:
import mysql.connector as msql
from mysql.connector import Error
try:
    mydb = msql.connect(host='127.0.0.1', user='root',  
                        password='upend764@')
    if mydb.is_connected():
        cursor = mydb.cursor()
        cursor.execute("CREATE DATABASE irisDB")
        print("irisDB database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

irisDB database is created

In [105]:
#mydb = connection.connect(host='127.0.0.1', user='root', passwd='upend764@',use_pure=True)

In [4]:
cursor.execute("SELECT * FROM student.my_table")

In [6]:
cursor.fetchall()

[('Aryan', 26, 'Kashyap', 7061229810),
 ('Vishal', 20, 'Kumar', 9308335369),
 ('Shweta', 24, 'Verma', 9634568521)]

In [7]:
cursor.execute("SHOW DATABASES")

In [11]:
cursor.fetchall()

[('capstoneproject',),
 ('class',),
 ('employees',),
 ('hr_analytics',),
 ('hranalytics',),
 ('imarticus',),
 ('information_schema',),
 ('irisdb',),
 ('mysql',),
 ('performance_schema',),
 ('practice',),
 ('sales',),
 ('store_sales',),
 ('student',),
 ('sys',),
 ('upen',),
 ('upenda764',),
 ('upenda7641',),
 ('upendra',)]

In [21]:
try:
    mydb = msql.connect(host='127.0.0.1', user='root', password='upend764@')
    
    if mydb.is_connected():
        cursor = mydb.cursor()
        #cursor.execute("select database();")
        #record = cursor.fetchone()
        #print("You're connected to database: ", record)
        #cursor.execute('DROP TABLE IF EXISTS iris;')
        #print('Creating table....')
        cursor.execute("CREATE TABLE irisdb.iris (sepal_length FLOAT(2,1), sepal_width FLOAT(2,1), petal_length FLOAT(2,1), petal_width FLOAT(2,1), species CHAR(11))")
        print("iris table is created....")
        for i,row in irisData.iterrows():
            sql = "INSERT INTO irisdb.iris VALUES (%s,%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            print("Record inserted")
            # the connection is not autocommitted by default, so we must commit to save our changes
            mydb.commit()
except Error as e:
    print("Error while connecting to MySQL", e)

iris table is created....
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

In [23]:
cursor.execute("Select * from irisdb.iris;")

In [24]:
cursor.fetchall()

[(5.1, 3.5, 1.4, 0.2, 'setosa'),
 (4.9, 3.0, 1.4, 0.2, 'setosa'),
 (4.7, 3.2, 1.3, 0.2, 'setosa'),
 (4.6, 3.1, 1.5, 0.2, 'setosa'),
 (5.0, 3.6, 1.4, 0.2, 'setosa'),
 (5.4, 3.9, 1.7, 0.4, 'setosa'),
 (4.6, 3.4, 1.4, 0.3, 'setosa'),
 (5.0, 3.4, 1.5, 0.2, 'setosa'),
 (4.4, 2.9, 1.4, 0.2, 'setosa'),
 (4.9, 3.1, 1.5, 0.1, 'setosa'),
 (5.4, 3.7, 1.5, 0.2, 'setosa'),
 (4.8, 3.4, 1.6, 0.2, 'setosa'),
 (4.8, 3.0, 1.4, 0.1, 'setosa'),
 (4.3, 3.0, 1.1, 0.1, 'setosa'),
 (5.8, 4.0, 1.2, 0.2, 'setosa'),
 (5.7, 4.4, 1.5, 0.4, 'setosa'),
 (5.4, 3.9, 1.3, 0.4, 'setosa'),
 (5.1, 3.5, 1.4, 0.3, 'setosa'),
 (5.7, 3.8, 1.7, 0.3, 'setosa'),
 (5.1, 3.8, 1.5, 0.3, 'setosa'),
 (5.4, 3.4, 1.7, 0.2, 'setosa'),
 (5.1, 3.7, 1.5, 0.4, 'setosa'),
 (4.6, 3.6, 1.0, 0.2, 'setosa'),
 (5.1, 3.3, 1.7, 0.5, 'setosa'),
 (4.8, 3.4, 1.9, 0.2, 'setosa'),
 (5.0, 3.0, 1.6, 0.2, 'setosa'),
 (5.0, 3.4, 1.6, 0.4, 'setosa'),
 (5.2, 3.5, 1.5, 0.2, 'setosa'),
 (5.2, 3.4, 1.4, 0.2, 'setosa'),
 (4.7, 3.2, 1.6, 0.2, 'setosa'),
 (4.8, 3.1, 1.6, 0.2, 'setosa'),
 (5.4, 3.4, 1.5, 0.4, 'setosa'),
 (5.2, 4.1, 1.5, 0.1, 'setosa'),
 (5.5, 4.2, 1.4, 0.2, 'setosa'),
 (4.9, 3.1, 1.5, 0.2, 'setosa'),
 (5.0, 3.2, 1.2, 0.2, 'setosa'),
 (5.5, 3.5, 1.3, 0.2, 'setosa'),
 (4.9, 3.6, 1.4, 0.1, 'setosa'),
 (4.4, 3.0, 1.3, 0.2, 'setosa'),
 (5.1, 3.4, 1.5, 0.2, 'setosa'),
 (5.0, 3.5, 1.3, 0.3, 'setosa'),
 (4.5, 2.3, 1.3, 0.3, 'setosa'),
 (4.4, 3.2, 1.3, 0.2, 'setosa'),
 (5.0, 3.5, 1.6, 0.6, 'setosa'),
 (5.1, 3.8, 1.9, 0.4, 'setosa'),
 (4.8, 3.0, 1.4, 0.3, 'setosa'),
 (5.1, 3.8, 1.6, 0.2, 'setosa'),
 (4.6, 3.2, 1.4, 0.2, 'setosa'),
 (5.3, 3.7, 1.5, 0.2, 'setosa'),
 (5.0, 3.3, 1.4, 0.2, 'setosa'),
 (7.0, 3.2, 4.7, 1.4, 'versicolor'),
 (6.4, 3.2, 4.5, 1.5, 'versicolor'),
 (6.9, 3.1, 4.9, 1.5, 'versicolor'),
 (5.5, 2.3, 4.0, 1.3, 'versicolor'),
 (6.5, 2.8, 4.6, 1.5, 'versicolor'),
 (5.7, 2.8, 4.5, 1.3, 'versicolor'),
 (6.3, 3.3, 4.7, 1.6, 'versicolor'),
 (4.9, 2.4, 3.3, 1.0, 'versicolor'),
 (6.6, 2.9, 4.6, 1.3, 'versicolor'),
 (5.2, 2.7, 3.9, 1.4, 'versicolor'),
 (5.0, 2.0, 3.5, 1.0, 'versicolor'),
 (5.9, 3.0, 4.2, 1.5, 'versicolor'),
 (6.0, 2.2, 4.0, 1.0, 'versicolor'),
 (6.1, 2.9, 4.7, 1.4, 'versicolor'),
 (5.6, 2.9, 3.6, 1.3, 'versicolor'),
 (6.7, 3.1, 4.4, 1.4, 'versicolor'),
 (5.6, 3.0, 4.5, 1.5, 'versicolor'),
 (5.8, 2.7, 4.1, 1.0, 'versicolor'),
 (6.2, 2.2, 4.5, 1.5, 'versicolor'),
 (5.6, 2.5, 3.9, 1.1, 'versicolor'),
 (5.9, 3.2, 4.8, 1.8, 'versicolor'),
 (6.1, 2.8, 4.0, 1.3, 'versicolor'),
 (6.3, 2.5, 4.9, 1.5, 'versicolor'),
 (6.1, 2.8, 4.7, 1.2, 'versicolor'),
 (6.4, 2.9, 4.3, 1.3, 'versicolor'),
 (6.6, 3.0, 4.4, 1.4, 'versicolor'),
 (6.8, 2.8, 4.8, 1.4, 'versicolor'),
 (6.7, 3.0, 5.0, 1.7, 'versicolor'),
 (6.0, 2.9, 4.5, 1.5, 'versicolor'),
 (5.7, 2.6, 3.5, 1.0, 'versicolor'),
 (5.5, 2.4, 3.8, 1.1, 'versicolor'),
 (5.5, 2.4, 3.7, 1.0, 'versicolor'),
 (5.8, 2.7, 3.9, 1.2, 'versicolor'),
 (6.0, 2.7, 5.1, 1.6, 'versicolor'),
 (5.4, 3.0, 4.5, 1.5, 'versicolor'),
 (6.0, 3.4, 4.5, 1.6, 'versicolor'),
 (6.7, 3.1, 4.7, 1.5, 'versicolor'),
 (6.3, 2.3, 4.4, 1.3, 'versicolor'),
 (5.6, 3.0, 4.1, 1.3, 'versicolor'),
 (5.5, 2.5, 4.0, 1.3, 'versicolor'),
 (5.5, 2.6, 4.4, 1.2, 'versicolor'),
 (6.1, 3.0, 4.6, 1.4, 'versicolor'),
 (5.8, 2.6, 4.0, 1.2, 'versicolor'),
 (5.0, 2.3, 3.3, 1.0, 'versicolor'),
 (5.6, 2.7, 4.2, 1.3, 'versicolor'),
 (5.7, 3.0, 4.2, 1.2, 'versicolor'),
 (5.7, 2.9, 4.2, 1.3, 'versicolor'),
 (6.2, 2.9, 4.3, 1.3, 'versicolor'),
 (5.1, 2.5, 3.0, 1.1, 'versicolor'),
 (5.7, 2.8, 4.1, 1.3, 'versicolor'),
 (6.3, 3.3, 6.0, 2.5, 'virginica'),
 (5.8, 2.7, 5.1, 1.9, 'virginica'),
 (7.1, 3.0, 5.9, 2.1, 'virginica'),
 (6.3, 2.9, 5.6, 1.8, 'virginica'),
 (6.5, 3.0, 5.8, 2.2, 'virginica'),
 (7.6, 3.0, 6.6, 2.1, 'virginica'),
 (4.9, 2.5, 4.5, 1.7, 'virginica'),
 (7.3, 2.9, 6.3, 1.8, 'virginica'),
 (6.7, 2.5, 5.8, 1.8, 'virginica'),
 (7.2, 3.6, 6.1, 2.5, 'virginica'),
 (6.5, 3.2, 5.1, 2.0, 'virginica'),
 (6.4, 2.7, 5.3, 1.9, 'virginica'),
 (6.8, 3.0, 5.5, 2.1, 'virginica'),
 (5.7, 2.5, 5.0, 2.0, 'virginica'),
 (5.8, 2.8, 5.1, 2.4, 'virginica'),
 (6.4, 3.2, 5.3, 2.3, 'virginica'),
 (6.5, 3.0, 5.5, 1.8, 'virginica'),
 (7.7, 3.8, 6.7, 2.2, 'virginica'),
 (7.7, 2.6, 6.9, 2.3, 'virginica'),
 (6.0, 2.2, 5.0, 1.5, 'virginica'),
 (6.9, 3.2, 5.7, 2.3, 'virginica'),
 (5.6, 2.8, 4.9, 2.0, 'virginica'),
 (7.7, 2.8, 6.7, 2.0, 'virginica'),
 (6.3, 2.7, 4.9, 1.8, 'virginica'),
 (6.7, 3.3, 5.7, 2.1, 'virginica'),
 (7.2, 3.2, 6.0, 1.8, 'virginica'),
 (6.2, 2.8, 4.8, 1.8, 'virginica'),
 (6.1, 3.0, 4.9, 1.8, 'virginica'),
 (6.4, 2.8, 5.6, 2.1, 'virginica'),
 (7.2, 3.0, 5.8, 1.6, 'virginica'),
 (7.4, 2.8, 6.1, 1.9, 'virginica'),
 (7.9, 3.8, 6.4, 2.0, 'virginica'),
 (6.4, 2.8, 5.6, 2.2, 'virginica'),
 (6.3, 2.8, 5.1, 1.5, 'virginica'),
 (6.1, 2.6, 5.6, 1.4, 'virginica'),
 (7.7, 3.0, 6.1, 2.3, 'virginica'),
 (6.3, 3.4, 5.6, 2.4, 'virginica'),
 (6.4, 3.1, 5.5, 1.8, 'virginica'),
 (6.0, 3.0, 4.8, 1.8, 'virginica'),
 (6.9, 3.1, 5.4, 2.1, 'virginica'),
 (6.7, 3.1, 5.6, 2.4, 'virginica'),
 (6.9, 3.1, 5.1, 2.3, 'virginica'),
 (5.8, 2.7, 5.1, 1.9, 'virginica'),
 (6.8, 3.2, 5.9, 2.3, 'virginica'),
 (6.7, 3.3, 5.7, 2.5, 'virginica'),
 (6.7, 3.0, 5.2, 2.3, 'virginica'),
 (6.3, 2.5, 5.0, 1.9, 'virginica'),
 (6.5, 3.0, 5.2, 2.0, 'virginica'),
 (6.2, 3.4, 5.4, 2.3, 'virginica'),
 (5.9, 3.0, 5.1, 1.8, 'virginica')]

# Checking with test.csv data

In [36]:
data = pd.read_csv("test.csv")

In [37]:
data.head()

     Name   Age   Surname       Phone
0    Harsh   25     Kumar  8102297062
1     Sonu   26       Raj  9103398061
2  Vishal    25  Kushwaha  6252789541
3    Anand   23     Mehta  7895416253
4   Vipul    27     Dubey  4565521463

In [30]:
import mysql.connector as msql
from mysql.connector import Error
try:
    mydb = msql.connect(host='127.0.0.1', user='root',  
                        password='upend764@')
    if mydb.is_connected():
        cursor = mydb.cursor()
        cursor.execute("Show Databases")
        for i in cursor.fetchall():
            print(i)
except Error as e:
    print("Error while connecting to MySQL", e)

('capstoneproject',)
('class',)
('employees',)
('hr_analytics',)
('hranalytics',)
('imarticus',)
('information_schema',)
('irisdb',)
('mysql',)
('performance_schema',)
('practice',)
('sales',)
('store_sales',)
('student',)
('sys',)
('upen',)
('upenda764',)
('upenda7641',)
('upendra',)

In [31]:
try:
    mydb = msql.connect(host='127.0.0.1', user='root', password='upend764@')
    
    if mydb.is_connected():
        cursor = mydb.cursor()
        #cursor.execute("select database();")
        #record = cursor.fetchone()
        #print("You're connected to database: ", record)
        #cursor.execute('DROP TABLE IF EXISTS iris;')
        #print('Creating table....')
        #cursor.execute("CREATE TABLE irisdb.iris (sepal_length FLOAT(2,1), sepal_width FLOAT(2,1), petal_length FLOAT(2,1), petal_width FLOAT(2,1), species CHAR(11))")
        #print("iris table is created....")
        for i,row in data.iterrows():
            sql = "INSERT INTO student.my_table VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            print("Record inserted")
            # the connection is not autocommitted by default, so we must commit to save our changes
            mydb.commit()
except Error as e:
    print("Error while connecting to MySQL", e)

Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

# Downloading data from database

In [99]:
mydb = msql.connect(host='127.0.0.1', user='root',  password='upend764@')

In [100]:
cursor = mydb.cursor()

In [ ]:
cursor.execute("select * from student.my_table")

In [ ]:
main_list = []

for i in cursor.fetchall():
    main_list.append(i)

In [90]:
main_list

[('Aryan', 26, 'Kashyap', 7061229810),
 ('Vishal', 20, 'Kumar', 9308335369),
 ('Shweta', 24, 'Verma', 9634568521),
 ('Harsh', 25, 'Kumar', 8102297062),
 ('Sonu', 26, 'Raj', 9103398061),
 ('Vishal ', 25, 'Kushwaha', 6252789541),
 ('Anand', 23, 'Mehta', 7895416253),
 ('Vipul ', 27, 'Dubey', 4565521463),
 ('Vijay', 22, 'Prajapati', 8574964152),
 ('Asif ', 25, 'Ali', 1234567885),
 ('Rahul ', 21, 'Kumar', 9638527418),
 ('Tomak ', 20, 'Gorai', 9685742314)]

In [97]:
import pandas

mydata = pd.DataFrame(main_list, columns = ["Name", "Age", "Surname", "Phone"])

In [98]:
mydata.head()

     Name  Age  Surname       Phone
0   Aryan   26  Kashyap  7061229810
1  Vishal   20    Kumar  9308335369
2  Shweta   24    Verma  9634568521
3   Harsh   25    Kumar  8102297062
4    Sonu   26      Raj  9103398061